public_html/C-C++/C++/Effective-c++/Effective-c++-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Effective C++(Item 1-10)</title>
<!-- 2015-03-05 Thu 23:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../../assets/stylesheet.css" />


</head>
<body>
<div id="content">
<h1 class="title">Effective C++(Item 1-10)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Item 1: View C++ as a federation of languages</a>
<ul>
<li><a href="#sec-1-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-2">Item 2: Prefer consts, enums, and inlines to #defines</a>
<ul>
<li><a href="#sec-2-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-3">Item 3: Use const whenever possible</a>
<ul>
<li><a href="#sec-3-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-4">Item 4: Make sure that objects are initialized before they're used</a>
<ul>
<li><a href="#sec-4-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-5">Item</a>
<ul>
<li><a href="#sec-5-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-6">Item</a>
<ul>
<li><a href="#sec-6-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-7">Item</a>
<ul>
<li><a href="#sec-7-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-8">Item</a>
<ul>
<li><a href="#sec-8-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-9">Item</a>
<ul>
<li><a href="#sec-9-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-10">Item</a>
<ul>
<li><a href="#sec-10-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-11">Item</a>
<ul>
<li><a href="#sec-11-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-12">Item</a>
<ul>
<li><a href="#sec-12-1">Tings to Remember</a></li>
</ul>
</li>
<li><a href="#sec-13">cc</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Item 1: View C++ as a federation of languages</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>C. C++仍然基于C。
</li>
<li>Object-Oriented C++.
</li>
<li>Template C++.
</li>
<li>The STL.
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Tings to Remember</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>高效的C++编程规则依赖于你使用C++的哪部分。
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Item 2: Prefer consts, enums, and inlines to #defines</h2>
<div class="outline-text-2" id="text-2">
<p>
当替换定值的 <code>#define</code> 时，有2种特殊情况。第一种是定值的指针，除了指针被声明为 <code>const</code> ，指针所指的内容同样也是定值的，需要写 <code>const</code> 两次如下：
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span> * <span style="color: #00ffff;">const</span> <span style="color: #eedd82;">authorName</span> = <span style="color: #ffa07a;">"Scott Mayers"</span>;
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">use string</span>
<span style="color: #00ffff;">const</span> <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">string</span> <span style="color: #87cefa;">authorName</span>(<span style="color: #ffa07a;">"Scott Mayers"</span>);
</pre>
</div>

<p>
第二种特殊情况是class特定的定值.限制类的定值范围,它必须是成员并且确保定值只有一份拷贝,它必须是 <code>static</code> 成员:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">class</span> <span style="color: #98fb98;">GamePlayer</span> {
 <span style="color: #00ffff;">private</span>:
  <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">NumTurns</span> = 5;  <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">const declaration</span>
  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">scores</span>[NumTurns];
};
</pre>
</div>
<p>
上面仅仅是声明，而不是它的定义。一般它的定义如下:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">const</span> <span style="color: #98fb98;">int</span> <span style="color: #7fffd4;">GamePlayer</span>::<span style="color: #eedd82;">NumTurns</span>;  <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">definition</span>
</pre>
</div>

<p>
把这放在实现文件，而不是头文件中。因为初始值在它的声明处提供， <b>在定义处不允许提供初始值。</b> 
</p>

<p>
如果使用 <code>enum</code> 可以如下:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">class</span> <span style="color: #98fb98;">GamePlayer</span> {
 <span style="color: #00ffff;">private</span>:
  <span style="color: #00ffff;">enum</span> { <span style="color: #eedd82;">NumTurns</span> = 5 };
  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">scores</span>[NumTurns];
};
</pre>
</div>

<p>
回到预编译，另外通常使用 <code>#define</code> 来实现类似函数的宏，可以不用产生函数调用的开销。如下的宏为例：
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">call f with the maximum of a and b</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #87cefa;">CALL_WITH_MAX</span>(<span style="color: #eedd82;">a</span>,<span style="color: #eedd82;">b</span>) f((a) &gt; (b) ? (a) : (b))
</pre>
</div>

<p>
如这样的宏有许多缺点。通过使用inline的模板函数，不但可以获得宏的所有效率，并且可以达到普通函数所有可预测的行为:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">template</span>&lt;<span style="color: #00ffff;">typename</span> <span style="color: #98fb98;">T</span>&gt;
<span style="color: #00ffff;">inline</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">callWithMax</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">T</span>&amp; <span style="color: #eedd82;">a</span>, <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">T</span>&amp; <span style="color: #eedd82;">b</span>)
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">because we don't know what T is, we pass by reference const.</span>
{
  f(a &gt; b? a : b);
}
</pre>
</div>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Tings to Remember</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>对于简单的constants,优先使用const对象和enum,而不是#define.
</li>
<li>对于类似函数的宏,优先使用inline函数,而不是#define.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Item 3: Use const whenever possible</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Tings to Remember</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>声明const帮助编译器侦测使用错误.const能被应用到任何地方的对象,从函数参数,到返回类型,到整个成员函数.
</li>
<li>编译器强制bitwise constness,但是你应使用概念性的定值来编程.
</li>
<li>当const和非const成员函数有一致的内在实现.代码重复可以避免,通过非
const版本调用const版本.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Item 4: Make sure that objects are initialized before they're used</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Tings to Remember</h3>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Item</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Tings to Remember</h3>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Item</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Tings to Remember</h3>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Item</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Tings to Remember</h3>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Item</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">Tings to Remember</h3>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Item</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">Tings to Remember</h3>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Item</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1">Tings to Remember</h3>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Item</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1">Tings to Remember</h3>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Item</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1">Tings to Remember</h3>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">cc</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">

<pre class="src src-c++"></pre>
</div>


<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2015-03-05 Thu 23:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
